---
kind: method
id: M:Autodesk.Revit.DB.FilteredElementIterator.Dispose
source: html/830c58e7-def0-c6fe-d4f8-01eaebc2c386.htm
---
# Autodesk.Revit.DB.FilteredElementIterator.Dispose Method

Releases all resources used by the FilteredElementIterator

## Syntax (C#)
```csharp
public void Dispose()
```